<?php
	require("header.php");
?>

<!DOCTYPE html>
<html>
<head>
	<title></title>
	<style type="text/css">
		
	</style>
</head>
<body>
	<div class="text_content">
		<h1>课程简介</h1>
		<ul>
			<p>课程编码：041C01043W（第一学期）　041C01044W（第二学期）</p>
			<p>课程名称：离散数学 </p>
        	<p>主讲教师：孙浩毓 李恩涛 唐波 施忠升 </p>               
			<p>辅导教师：孙浩毓 李恩涛 唐波 施忠升 </p>
			<p>学时数：128学时</p>
			<p>学分数：7学分 </p>
			<p>适用专业、层次：计算机科学与技术专业本科生</p> 
			<p>先修课程：微积分初步</p>
			<p>内容简介：离散数学课程是计算机专业的一门非常重要的基础核心课程，主要内容为：集合论（集合的概念、幂集和笛卡尔积、关系及其运算、关系的闭包、次序关系、相容关系、等价关系、映射），代数系统（代数系统的基本概念、半群、单元半群、群论、格与布尔代数），图论初步（图及其矩阵表示、图的连通性、欧拉图与哈密顿土、树、有向树、平面图与两步图），数理逻辑（命题演算、谓词演算、命题演算和谓词演算的公理化理论），应用部分（形式语言和自动机以及纠错码初步）。通过该门课程的学习，为学习计算机后继课程打下良好基础。</p> 
			<p>教材及教学参考书 ： </p>
			<p>《离散数学》，左孝凌，上海科学技术文献出版社</p>



		</ul>
	</div>>
</body>
</html>

<?php
	require("footer.php");
?>