<?php
	require("header.php");
?>

<!DOCTYPE html>
<html>
<head>
	<title></title>
	<style type="text/css">
		
	</style>
</head>
<body>
	<div class="text_content">
		<h1>《离散数学》教学大纲</h1>
		<ul>
			<p>一、说明</p>
			<p>（一）本课程的教学基本任务及目的 </p>
			<p>1．离散数学主要研究离散对象之间的数量结构和相互关系。它是现代数学的一个重要分支，是计算机专业基础理论的核心课程之一。</p> 
			<p>2．本课程主要包括数理逻辑、集合论、代数系统、图论四部分内容。它是为学习计算机各专业课程准备必要的数学知识，提供数学模型。 </p>
			<p>3．通过本课程的教学不仅使学生掌握离散数学的基础知识和基本理论，了解离散对象的特征，同时能掌握处理离散对象的一些基本方法。从而培养和提高学生的抽象思维能力、逻辑推理能力及解决实际问题的能力。 </p>
			<p>（二）与其它课程的联系 </p>
			<p>1．前导课程：高等数学、线性代数 </p>
			<p>2．后继课程：数据结构、操作系统、数据库、软件工程、计算机系统结构等。</p> 
			<p>（三）参考教学学时 </p>
			<p> 计算机科学与技术专业（72+56）</p> 
			<p>（四）教材及参考书 </p>
			<p>1．《离散数学》，   左孝凌等编著， 上海科技文献出版社，   1982 </p>
			<p>2．《离散数学》，   耿素云等编著，   清华大学出版社，     1992 </p>
			<p>3．《离散数学导论》，徐结磐编著，    高等教育出版社，     </p>
			<p>4．《简明离散数学》，王存礼等编著，  天津人民出版社，     1996 </p>
			<p>5．《离散数学》，    王元元等编著，    科学出版社，       1994 </p>
			<p>6．《Discrete  Mathematical  structures  for  Computer  Science》   
			Bernard  Kolman  Bobertc.  Busby,Newjersey </p>
		</ul>
	</div>>
</body>
</html>

<?php
	require("footer.php");
?>