<?php
	require("header.php");
?>

<!DOCTYPE html>
<html>
<head>
	<title></title>
	<style type="text/css">
		
	</style>
</head>
<body>
	<div class="text_content">
		<h1>课程特色</h1>
		<ul>
			<p>1．根据课程特点,采用行之有效的多媒体教学，大大激发了学生的学习兴趣 。</p>
			<p>坚持使用现代教育手段进行多媒体教学，激发学生学习兴趣，而兴趣是学习最好的老师；通过发挥多种媒体的综合优势，介绍学科的最新发展，激发学生的创新意识和培养创新能力，而创新意识和创新能力的培养是工程教育的核心。</p>
			<p>2．坚持以知识为载体，培养学生的思维方式和方法。 </p>     
			<p>开设了讨论课，实行参与式教学。讨论题目多为无标准答案的题目，提前将讨论题目发给学生，让学生自由组合分组作准备，讨论课上，各组派代表上台主讲，由教师和其他同学发问，最后由教师进行总结。这样做有利于学生思维方式和方法的培养。</p>
			<p>3．尝试将讲授型教学向研究型教学过渡,重视学生自主学习和获取知识能力的培养。</p>
			<p>将部分教学内容转化为研究型教学，让学生通过自学和查阅有关文献，发现问题并分析产生问题的原因，提出相应对策。通过这一过程培养了学生自主学习和获取知识的能力；推荐国外高水平的原版教材作为教学参考书，坚持采用中文讲授英文板书进行课堂教学,受到学生欢迎。</p>
			<p>4．建立了新的评价体系和考核方法。</p>
			<p>改变一次考试定终身的评价方式，重视对学生学习过程的评价与鼓励。在总成绩中平时作业占讨论课占5%，作业占10%，出勤占5%，期中占20%，期中考试采取开卷考试，期末考试占60%左右．</p>
		</ul>
	</div>>
</body>
</html>

<?php
	require("footer.php");
?>