<?php
	require("header.php");
?>

<!DOCTYPE html>
<html>
<head>
	<title></title>
	<style type="text/css">
		
	</style>
</head>
<body>
	<div class="text_content">
		<h1>课程要素</h1>
		<ul>
			<p>（1）讲授：坚持讲重点、讲难点、讲思路、讲方法、讲学科前沿，努力作到少、精、宽、新；坚持启发式教学，以知识为载体，培养学生分析解决问题的思维方式和方法，逐渐使课程从讲授型向研究型转变；坚持根据课程特点采用行之有效的多媒体教学，激发学生学习兴趣，增加课堂信息量，培养学生形象思维及创新思维能力。</p>
			<p>（2）讨论：讨论课上，进行参与式教学，讨论题目为综合型。创造条件让学生有机会在课堂上发表自己的观点与见解。教师事先将题目发给学生，让学生课余分组查阅资料及准备，然后在课堂上由学生主讲，展开讨论，最后由教师总结。</p>
			<p>（3）作业：安排一定量的基本要求的习题，贯彻讲、练原则。</p>
			<p>（4）考核：改变期末书面考试一次定终身的做法， 加强对学生学习过程的检查与评定。在总成绩中，讨论课占5%，作业占10%，出勤占5%，期中占20%，期中考试采取开卷考试，期末考试占60%左右。</p>
			<p>（5）教材：采用由左孝凌主编的的国家级重点教材和面向21世纪课程教材作为主教材，该套教材为众多院校考研指定教材；配以适合学生自学的辅助教材，同时选用国外著名大学有关教材作为向学生推荐的参考书。</p>
		</ul>
	</div>>
</body>
</html>

<?php
	require("footer.php");
?>