<?php
	require("header.php");
?>
	
<!DOCTYPE html>
<html>
<head>
	<title></title>
	<style type="text/css">
		
	</style>
</head>
<body>
	<div class="text_content">
		<h1>前	言</h1>
		<ul>
			<p>离散数学是现代数学的一个重要分支，是一门与计算机联系较密切的数学。</p>
			<p>它以研究离散量度的结构和相互间的关系为主要目标，其研究对象是离散数量关系和离散结构数学的模型。 </p>
			<p>一般认为，离散数学包含以下学科： </p>
			<p>1) 集合论，数理逻辑与元数学。 </p>
			<p>2) 图论，算法图论；组合数学，组合算法。</p> 
			<p>3) 抽象代数。 </p>
			<p>离散数学作为数学工具，充分描述了计算机科学离散性的特点，对计算机的发展，计算机科学的研究起着重大的作用。</p>
			<p>计算机科学中普遍地采用离散数学中的一些基本概念，基本思想，基本方法，它的各个分支的概念、理论和方法大量地应用在计算机科学中的数字电路、编译原理、数据结构、操作系统、数据库系统、算法的分析与设计、人工智能、计算机网络、系统结构，容错诊断，机器定理证明等各个方面。</p>
			<p>同时，离散数学所提供的训练十分有益于学生概括抽象能力、逻辑思维能力、归纳构造能力的提高，十分有益于学生严谨、完整、规范的科学态度的培养。</p>
		</ul>
	</div>>
</body>
</html>>

<?php
	require("footer.php");
?>

