<?php
	require("header.php");
?>

<!DOCTYPE html>
<html>
<head>
	<title></title>
	<style type="text/css">
		
	</style>
</head>
<body>
	<div class="text_content">
		<h1>方法手段 </h1>
		<ul>
			<p>1. 采用启发式教学，激发学生创造性思维</p>
			<p>提高教学质量的关键在于提高课堂教学质量。 在课堂教学中，我们坚持启发式教学，以知识为载体，培养学生分析解决问题的思维方式和方法。在教学内容中，注意强化基础，拓宽知识，优化知识结构，处理好“少而精”与“广而新”的关系，注重及时将科学前沿和工程技术的最新发展引入教学，拓展学生的视野和增加学生的知识面，培养学生的创新意识和“终身”学习能力；在课堂教学形式上，注意不拘一格，重在师生交流启发式地“教”，重点讲思路、讲方法，引导学生通过探索进行学习，避免简单地“灌输型”传授知识，鼓励学生独立思考、大胆质疑，引导学生多方位、多角度地发现问题和解决问题，将传统的以教师为中心的课堂教学模式转变为以学生为主体的教学模式，活跃了课堂气氛，既调动了学生学习的积极性，又培养了学生的能力。</p>
			<p>2.使教学从讲授型向研究型转变，促进学生个性发展，培养学生的学习能力 </p>
			<p>为了建立教师授课—学生自学，以及教师－学生互动的教学模式，我们采用大讨论与研究相结合的形式，针对教学内容的难点和重点增加了专题讨论课，实行参与式教学。引导学生带着问题学是增强教学效果的一种有效手段，也是理论联系实际的有效途径。除了在课堂教学中通过工程实际问题引出理论知识点，还设置了与课堂教学配套的综合训练。</p>
			<p>3. 采用多维立体化的教学手段，激发学生学习兴趣，增加课堂信息量</p>
			<p>以教师自主开发的高水平多媒体课件和电子教案为核心，构建了录像、多媒体课件、网络课堂等多位一体的教学平台。 根据课程特点，采用行之有效的多媒体教学，通过文字、图像、动画、视频，激发学生的学习兴趣，增加课堂信息量，提高学生的形象思维及创新思维能力；同时，强调教师通过语言、板书和形体动作向学生传授知识。</p>
			<p>4. 改革考试评价方式，增强学生学习的自觉性和主动性</p>
			<p>考试作为教学评价的重要手段，对学生学习和教师教学具有重要的导向作用。我们长期坚持积极探索考试方法的改革，引导学生改进学习方法。传统考试的主要形式是一次性定时闭卷考试。这种考试方法有诸多弊端，一是会造成学生考前临时突击，放松平时的学习；二是不利于考察学生综合运用知识解决问题的能力，难于发挥创新思维能力。针对以上弊端，我们对离散数额课程考试方式进行了改革。 对于机械原理课程，学生总成绩的计算包括5部分：期末考试成绩、期中考试成绩、平时作业成绩、平时出勤成绩、专题讨论课成绩，分别各占总分的一定比例。期中考试方式从闭卷考试改为开卷考试，上述考核评价方式使学生成绩考核遍布整个教学过程，促使学生重视每一个教学环节，使学生的学习过程变成循序渐进的过程，避免了学生突击应付考试的现象，提高了学生平时学习的自觉性和主动性。</p>
		</ul>
	</div>>
</body>
</html>

<?php
	require("footer.php");
?>