<?php
	require("header.php");
?>

<!DOCTYPE html>
<html>
<head>
	<title></title>
	<link rel="stylesheet" type="text/css" href="css/zoom.css">
</head>
<body>
	<div class="book_introduce">
		<h1>内容简介</h1>
		<p>
			《离散数学学习指导与习题解析（第2版）》是2015年出版的《离散数学》（第2版）的配套教学参考书，与主教材做了同步更新。《离散数学学习指导与习题解析（第2版）》分为数理逻辑、集合论、代数结构、组合数学、图论、初等数论6个部分。每部分按章对相关知识点进行了*面的总结，并对解题方法进行了系统的分析和阐述。各章都按照内容提要，基本要求，习题课，习题、解答或提示，小测验进行组织，并在*后给出了4套综合性的模拟试题，*书包含各种练习题上千道。
　　《离散数学学习指导与习题解析（第2版）》既可作为高等学校计算机及相关专业离散数学课程的教学参考书，也可为其他学习离散数学的读者，特别是初学者提供有益的帮助。
		</p>
		<h1>作者简介</h1>
		<p>
			屈婉玲，北京大学信息科学技术学院教授、博士生导师，中国人工智能学会离散数学专委会委员。主要研究方向是算法设计与分析，发表论文20余篇，出版教材、教学参考书、译著20余部。所讲授的离散数学课程被评为国家精品课程，两次被评为北京大学十佳教师，并获得北京市优秀教师称号。曾主持过多项国家教材和课程建设项目，并获得北京市教育教学成果（高等教育）一等奖。
　　
		　　耿素云，北京大学信息科学技术学院教授。一直从事数学教学工作，致力于离散数学教学20余年，出版教材、教学参考书20余部。被评为北京市教书育人、眼务育人先进工作者，北京市优秀教师；曾获北京市教育教学成果（高等教育）一等奖，北京大学教学成果一等奖、大众电脑奖教金、桐山奖教金及教学优秀奖等。
		　　
		　　张立昂，北京大学信息科学技术学院教授、博士生导师。一直从事数学和理论计算机科学的教学与研究工作，主要研究方向是计算复杂性理论和算法设计与分析，发表论文20余篇，出版教材、教学参考书、译著20余部。曾获教育部科学技术进步二等奖，北京市教育教学成果（高等教育）一等奖，北京大学教学成果一等奖、正大奖教金及教学优秀奖等。
		</p>
		<h1>目录</h1>
		<p>
			第1部分 数理逻辑
			第1章 命题逻辑基本概念
			1．1 内容提要
			1．2 基本要求
			1．3 习题课
			1．4 习题、解答或提示
			1．5 小测验
			第2章 命题逻辑等值演算
			2．1 内容提要
			2．2 基本要求
			2．3 习题课
			2．4 习题、解答或提示
			2．5 小测验
			第3章 命题逻辑的推理理论
			3．1 内容提要
			3．2 基本要求
			3．3 习题课
			3．4 习题、解答或提示
			3．5 小测验
			第4章 一阶逻辑基本概念
			4．1 内容提要
			4．2 基本要求
			4．3 习题课
			4．4 习题、解答或提示
			4．5 小测验
			第5章 一阶逻辑等值演算与推理
			5．1 内容提要
			5．2 基本要求
			5．3 习题课
			5．4 习题、解答或提示
			5．5 小测验

			第2部分 集合论
			第6章 集合代数
			6．1 内容提要
			6．2 基本要求
			6．3 习题课
			6．4 习题、解答或提示
			6．5 小测验
			第7章 二元关系
			7．1 内容提要
			7．2 基本要求
			7．3 习题课
			7．4 习题、解答或提示
			7．5 小测验
			第8章 函数
			8．1 内容提要
			8．2 基本要求
			8．3 习题课
			8．4 习题、解答或提示
			8．5 小测验

			第3部分 代数结构
			第9章 代数系统
			9．1 内容提要
			9．2 基本要求
			9．3 习题课
			9．4 习题、解答或提示
			9．5 小测验
			第10章 群与环
			10．1 内容提要
			10．2 基本要求
			10．3 习题课
			10．4 习题、解答或提示
			10．5 小测验
			第11章 格与布尔代数
			11．1 内容提要
			11．2 基本要求
			11．3 习题课
			11．4 习题、解答或提示
			11．5 小测验

			第4部分 组合数学
			第12章 基本的组合计数公式
			12．1 内容提要
			12．2 基本要求
			12．3 习题课
			12．4 习题、解答或提示
			12．5 小测验
			第13章 递推方程与生成函数
			13．1 内容提要
			13．2 基本要求
			13．3 习题课
			13．4 习题、解答或提示
			13．5 小测验

			第5部分 图论
			第14章 图的基本概念
			14．1 内容提要
			14．2 基本要求
			14．3 习题课
			14．4 习题、解答或提示
			14．5 小测验
			第15章 欧拉图与哈密顿图
			15．1 内容提要
			15．2 基本要求
			15．3 习题课
			15．4 习题、解答或提示
			15．5 小测验
			第16章 树
			16．1 内容提要
			16．2 基本要求
			16．3 习题课
			16．4 习题、解答或提示
			16．5 小测验
			第17章 平面图
			17．1 内容提要
			17．2 基本要求
			17．3 习题课
			17．4 习题、解答或提示
			17．5 小测验
			第18章 支配集、覆盖集、独立集、匹配
			与着色
			18．1 内容提要
			18．2 基本要求
			18．3 习题课
			18．4 习题、解答或提示
			18．5 小测验

			第6部分 初等数论
			第19章 初等数论
			19．1 内容提要
			19．2 基本要求
			19．3 习题课
			19．4 习题、解答或提示
			19．5 小测验

			模拟试题及解答
			试题1
			试题1解答
			试题2
			试题2解答
			试题3
			试题3解答
			试题4
			试题4解答
		</p>
	</div>
	<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.11.0/jquery.min.js"></script>
	<script src="https://netdna.bootstrapcdn.com/bootstrap/3.0.0/js/bootstrap.min.js"></script>
	<script src="js/zoom.js"></script>
</body>
</html>

<?php
	require("footer.php");
?>