<?php
	require("header.php");
?>

<!DOCTYPE html>
<html>
<head>
	<title></title>
	<link rel="stylesheet" type="text/css" href="css/zoom.css">
</head>
<body>
	<div class="book_introduce">
		<h1>内容简介</h1>
		<p>
			《计算机科学丛书：离散数学及其应用（原书第7版）》是介绍离散数学理论和方法的经典教材，已经成为采用率高的离散数学教材，被美国众多名校用作教材，获得了极大的成功。中文版也已被国内大学广泛采用为教材。作者参考使用教师和学生的反馈，并结合自身对教育的洞察，对第7版做了大量的改进，使其成为更有效的教学工具。《计算机科学丛书：离散数学及其应用（原书第7版）》可作为1至2个学期的离散数学课入门教材，适用于数学、计算机科学、计算机工程、信息技术等专业的学生。
		</p>
		<h1>作者简介</h1>
		<p>
			　Kenneth H.Rosen，作为位于新泽西州蒙茅斯县的AT＆T实验室杰出技术会员已经拥有一段很长的职业生涯。目前他在蒙茅斯大学任访问研究教授，为研究生讲授计算机科学课程。
　　Rosen博士于1972年获得位于安娜堡的密歇根大学数学学士学位，1976年获得麻省理工学院数学博士学位，在哈罗德·斯塔克（Harold Stark）的指导下他撰写了数论方面的博士论文。1982年加入贝尔实验室之前，他曾就职于科罗拉多大学博尔德分校；哥伦布市的俄亥俄州立大学；在欧洛诺市的缅因大学任数学副教授。在AT&T工作时，他在蒙茅斯大学任教，教授离散数学、编码理论和数据安全方面的课程。他目前教授算法设计以及计算机安全和密码学方面的课程。
		</p>
		<h1>内页插图</h1>
			<img src="image/book_2_1.jpg" data-action="zoom" class="pull-left">
			<img src="image/book_2_2.jpg" data-action="zoom" class="pull-left">
			<img src="image/book_2_3.jpg" data-action="zoom" class="pull-left">
			<img src="image/book_2_4.jpg" data-action="zoom" class="pull-left">
		<h1>目录</h1>
		<p>
			版者的话
译者序
前言
配套网站
致学生
关于作者
符号表
第1章 基础：逻辑和证明
1．1 命题逻辑
1．1．1 引言
1．1．2 命题
1．1．3 条件语句
1．1．4 复合命题的真值表
1．1．5 逻辑运算符的优先级
1．1．6 逻辑运算和位运算
练习
1．2 命题逻辑的应用
．1．2．1 引言
l．2．2 语句翻译
1．2．3 系统规范说明
1．2．4 布尔搜索
1．2．5 逻辑谜题
1．2．6 逻辑电路
练习
1．3 命题等价式
1．3．1 引言
1．3．2 逻辑等价式
1．3．3 德．摩根律的运用
1．3．4 构造新的逻辑等价式
1．3．5 命题的可满足性
1．3．6 可满足性的应用
1．3．7 可满足性问题求解
练习
1．4 谓词和量词
1．4．1 引言
1．4．2 谓词
l．4．3 量词
1．4．4 约束论域的量词
1．4．5 量词的优先级
1．4．6 变量绑定
1．4．7 涉及量词的逻辑等价式
1．4．8 量化表达式的否定
1．4．9 语句到逻辑表达式的翻译
1．4．10 系统规范说明中量词的使用
1．4．11 选自路易斯．卡罗尔的例子
1．4．12 逻辑程序设计
练习
1．5 嵌套量词
1．5．1 引言
1．5．2 理解涉及嵌套量词的语句
1．5．3 量词的顺序
1．5．4 数学语句到嵌套量词语句的翻译
1．5．5 嵌套量词到自然语言的翻译
1．5．6 汉语语句到逻辑表达式的翻译
1．5．7 嵌套量词的否定
练习
1．6 推理规则
l．6．1 引言
1．6．2 命题逻辑的有效论证
1．6．3 命题逻辑的推理规则
1．6．4 使用推理规则建立论证
1．6．5 消解律
1．6．6 谬误
1．6．7 量化命题的推理规则
1．6．8 命题和量化命题推理规则的组合使用
练习
1．7 证明导论
1．7．1 引言
1．7．2 一些专用术语
1．7．3 理解定理是如何陈述的
1．7．4 证明定理的方法
1．7．5 直接证明法
1．7．6 反证法
1．7．7 归谬证明法
1．7．8 证明中的错误
1．7．9 良好的开端
练习
1．8 证明的方法和策略
1．8．1 引言
1．8．2 穷举证明法和分情形证明法
1．8．3 存在性证明
1．8．4 唯一性证明
1．8．5 证明策略
1．8．6 寻找反例
1．8．7 证明策略实践
1．8．8 拼接
1．8．9 开放问题的作用
1．8．10 其他证明方法
练习
关键术语和结论
复习题
补充练习
计算机课题
计算和探索
写作课题
第2章 基本结构：集合、函数、
序列、求和与矩阵
2．1 集合
2．1．1 引言
2．1．2 文氏图
2．1．3 子集
2．1．4 集合的大小
2．1．5 幂集
2．1．6 笛卡儿积
2．1．7 使用带量词的集合符号
2．1．8 真值集和量词
练习
2．2 集合运算
2．2．1 引言
2．2．2 集合恒等式
2．2．3 扩展的并集和交集
2．2．4 集合的计算机表示
练习
2．3 函数
2．3．1 引言
2．3．2 一对一函数和映上函数
2．3．3 反函数和函数组合
2．3．4 函数的图
2．3．5 一些重要的函数
2．3．6 部分函数
练习
2．4 序列与求和
2．4．l 引言
2．4．2 序列
2．4．3 递推关系
2．4．4 特殊的整数序列
2．4．5 求和
练习
2．5 集合的基数
2．5．1 引言
2．5．2 可数集
……
第3章 算法
第4章 数论和密码学
第5章 归纳与递归
第6章 计数
第7章 离散概率
第8章 高级计数技术
第9章 关系
第10章 图
第11章 树
第12章 布尔代数
第13章 计算模型
附录
		</p>
	</div>
	<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.11.0/jquery.min.js"></script>
	<script src="https://netdna.bootstrapcdn.com/bootstrap/3.0.0/js/bootstrap.min.js"></script>
	<script src="js/zoom.js"></script>
</body>
</html>

<?php
	require("footer.php");
?>