<?php
	require("header.php");
?>

<!DOCTYPE html>
<html>
<head>
	<title></title>
	<link rel="stylesheet" type="text/css" href="css/zoom.css">
</head>
<body>
	<div class="book_introduce">
		<h1>编辑推荐</h1>
		<p>
			紧密围绕离散数学的基本概念、基本理论选材，体系严谨，内容丰富；面向计算机科学技术，介绍了很多离散数学在计算机科学技术中的应用。
			强化描述与分析离散结构的基本方法与能力的训练，配有丰富的例题和习题；例题有针对性，分析讲解到位；习题易难结合，适合学生课后练习。
			知识体系采用模块化结构，可以根据不同的教学要求进行调整；语言通俗易懂，深入浅出，突出重点、难点，提示易于出错的地方。
			辅助教学资源丰富，配有用于习题课、包含上千道习题的教学辅助用书《离散数学学习指导与习题解析》第2版，电子教案，网络课程等。
		</p>
		<h1>内容简介</h1>
		<p>
			《离散数学（第2版）》在原有基础上进行了更新，增加了一些典型的应用实例，并对例题和习题进行了补充。《离散数学（第2版）》分为数理逻辑、集合论、代数结构、组合数学、图论、初等数论6个部分，既有严谨、系统的理论阐述，也有丰富的、面向计算机科学技术发展的应用实例，同时配有大量的典型例题与练习。各章内容按照模块化结构组织，可以适应不同的教学要求。《离散数学（第2版）》配套有电子教案和学习指导与习题解析。《离散数学（第2版）》可以作为普通高等学校计算机科学与技术、软件工程、信息与计算科学等专业本科生离散数学课程教材，也可以供其他专业学生和科技人员参考。
		</p>
		<h1>作者简介</h1>
		<p>
			耿素云，北京大学信息科学技术学院教授。一直从事数学教学工作，致力于离散数学教学20余年，出版教材、教学参考书20余本，其中包含多部国家级规划教材和北京市精品教材。被评为北京市教书育人、服务育人先进工作者，北京市优秀教师，北京大学“我爱我师一*受学生爱戴的老师”；曾获北京市教育教学成果（高等教育）一等奖，北京大学教学成果一等奖、大众电脑奖教金、桐山奖教金及教学优秀奖等。
　　
　　		张立昂，北京大学信息科学技术学院教授、博士生导师。一直从事数学和理论计算机科学的教学与研究工作，主要研究方向是计算复杂性理论和算法设计与分析，发表论文20余篇，出版教材、教学参考书、译著20余本，其中包含多部国家级规划教材和北京市精品教材。曾获教育部科学技术进步二等奖，北京市教育教学成果（高等教育）一等奖，北京人学教学成果一等奖、正大奖教金及教学优秀奖等。
		</p>
		<h1>内页插图</h1>
			<img src="image/book_1_1.jpg" data-action="zoom" class="pull-left">
			<img src="image/book_1_2.jpg" data-action="zoom" class="pull-left">
			<img src="image/book_1_3.jpg" data-action="zoom" class="pull-left">
			<img src="image/book_1_4.jpg" data-action="zoom" class="pull-left">
		<h1>目录</h1>
		<p>
			第1部分 数理逻辑
			第1章 命题逻辑的基本概念
			1.1 命题与联结词
			1.2 命题公式及其赋值
			习题1
			第2章 命题逻辑等值演算
			2.1 等值式
			2.2 析取范式与合取范式
			2.3 联结词的完备集
			2.4 可满足性问题与消解法
			习题2
			第3章 命题逻辑的推理理论
			3.1 推理的形式结构
			3.2 自然推理系统P
			3.3 消解证明法
			习题3
			第4章 一阶逻辑基本概念
			4.1 一阶逻辑命题符号化
			4.2 一阶逻辑公式及其解释
			习题4
			第5章 一阶逻辑等值演算与推理
			5.1 一阶逻辑等值式与置换规则
			5.2 一阶逻辑前束范式
			5.3 一阶逻辑的推理理论
			习题5

			第2部分 集合论
			第6章 集合代数
			6.1 集合的基本概念
			6.2 集合的运算
			6.3 有穷集的计数
			6.4 集合恒等式
			习题6
			第7章 二元关系
			7.1 有序对与笛卡儿积
			7.2 二元关系
			7.3 关系的运算
			7.4 关系的性质
			7.5 关系的闭包
			7.6 等价关系与划分
			7.7 偏序关系
			习题7
			第8章 函数
			8.1 函数的定义与性质
			8.2 函数的复合与反函数
			8.3 双射函数与集合的基数
			8.4 一个电话系统的描述实例
			习题8

			第3部分 代数结构
			第9章 代数系统
			9.1 二元运算及其性质
			9.2 代数系统
			9.3 代数系统的同态与同构
			习题9
			第10章 群与环
			10.1 群的定义及性质
			10.2 子群与群的陪集分解
			10.3 循环群与置换群
			10.4 环与域
			习题10
			第11章 格与布尔代数
			11.1 格的定义与性质
			11.2 分配格、有补格与布尔代数
			习颢11

			第4部分 组合数学
			第12章 基本的组合计数公式
			12.1 加法法则与乘法法则
			12.2 排列与组合
			12.3 二项式定理与组合恒等式
			12.4 多项式定理
			习题12
			第13章 递推方程与生成函数.
			13.1 递推方程的定义及实例
			13.2 递推方程的公式解法
			13.3 递推方程的其他解法.
			13.4 生成函数及其应用
			13.5 指数生成函数及其应用
			13.6 cataIan数与stirling数
			习题13

			第5部分 图 论
			第14章 图的基本概念
			14.1 图
			14.2 通路与回路
			14.3 图的连通性
			14.4 图的矩阵表示
			14.5 图的运算
			习题14
			第15章 欧拉图与哈密顿图
			15.1 欧拉图
			15.2 哈密顿图
			15.3 最短路问题、中国邮递员问题与货郎担问题
			习题15
			第16章 树
			16.1 无向树及其性质
			16.2 生成树
			16.3 根树及其应用
			习题16
			第17章 平面图
			17.1 平面图的基本概念
			17.2 欧拉公式
			17.3 平面图的判断
			17.4 平面图的对偶图
			习题17
			第18章 支配集、覆盖集、独立集、匹配与着色
			18.1 支配集、点覆盖集与点独立集
			18.2 边覆盖集与匹配
			18.3 二部图中的匹配
			18.4 点着色
			18.5 地图着色与平面图的点着色
			18.6 边着色
			习题18

			第6部分 初等数论
			第19章 初等数论
			19.1 素数
			19.2 最大公约数与最小公倍数
			19.3 同余
			19.4 一次同余方程
			19.5 欧拉定理和费马小定理
			19.6 初等数论在计算机科学技术中的几个应用
			习题19

			名词与术语索引
			符号注释
			参考文献
		</p>
	</div>
	<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.11.0/jquery.min.js"></script>
	<script src="https://netdna.bootstrapcdn.com/bootstrap/3.0.0/js/bootstrap.min.js"></script>
	<script src="js/zoom.js"></script>
</body>
</html>

<?php
	require("footer.php");
?>